INSERT INTO user_storage (name, email, gender, age, height, weight, goal, calorie_norm)
VALUES 
    ('Иван Иванов', 'ivan.ivanov@example.com', 'MALE', 30, 180, 75, 'LOSS', 1518);

INSERT INTO dish(name, calorie, proteins, fats, carbohydrates) VALUES
    ('Салат Цезарь', 300, 15, 20, 10),         -- dish_id = 1
    ('Творог с медом', 150, 12, 5, 15),       -- dish_id = 2
    ('Куриная грудка на гриле', 250, 30, 5, 0), -- dish_id = 3
    ('Брокколи на пару', 100, 8, 1, 20),     -- dish_id = 4
    ('Паста с соусом', 600, 20, 10, 80),       -- dish_id = 5
    ('Овсянка с ягодами', 200, 6, 3, 30),     -- dish_id = 6
    ('Фрукты (банан)', 100, 1, 0.3, 27),       -- dish_id = 7
    ('Рис с овощами', 400, 8, 2.5, 85);        -- dish_id = 8

-- День 1
INSERT INTO meal(user_id, dish_id, date, time) VALUES
    (1, 1, '2023-10-01', '08:00'), -- Салат Цезарь (300 кал)
    (1, 2, '2023-10-01', '08:00'), -- Творог с медом (150 кал)
    (1, 3, '2023-10-01', '14:00'), -- Куриная грудка на гриле (250 кал)
    (1, 4, '2023-10-01', '14:00'), -- Брокколи на пару (100 кал)
    (1, 5, '2023-10-01', '18:00'), -- Паста с соусом (600 кал)
    (1, 7, '2023-10-01', '18:00'); -- Фрукты (банан) (100 кал)

-- Подсчет общего количества калорий за каждый день:
-- День 1:
-- Салат Цезарь + Творог + Куриная грудка + Брокколи + Паста + Фрукты =
-- =300 + 150 + 250 + 100 + 600 + 100  
-- =1500кал.

-- День 2
INSERT INTO meal(user_id, dish_id, date, time) VALUES
    (1, 6, '2023-10-02', '08:00'), -- Овсянка с ягодами (200 кал)
    (1, 2, '2023-10-02', '08:00'), -- Творог с медом (150 кал)
    (1, 3, '2023-10-02', '14:00'), -- Куриная грудка на гриле (250 кал)
    (1, 4, '2023-10-02', '14:00'), -- Брокколи на пару (100 кал)
    (1, 5, '2023-10-02', '18:00'), -- Паста с соусом (600 кал)
    (1, 7, '2023-10-02', '18:00'); -- Фрукты (банан) (100 кал)

-- День 2:
-- Овсянка + Творог + Куриная грудка + Брокколи + Паста + Фрукты =
-- =200 + 150 + 250 + 100 + 600 + 100
-- =1400кал.

-- День 3
INSERT INTO meal(user_id, dish_id, date, time) VALUES
    (1, 6, '2023-10-03', '08:00'), -- Овсянка с ягодами(200кал)
    (1, 2, '2023-10-03', '08:00'), -- Творог с медом (150кал)
    (1, 3, '2023-10-03', '14:00'), -- Куриная грудка на гриле (250кал)
    (1, 8, '2023-10-03', '14:00'), -- Рис с овощами (400кал)
    (1, 5, '2023-10-03', '18:00'), -- Паста с соусом (600кал)
    (1, 7, '2023-10-03', '18:00'); -- Фрукты (банан) (100кал)

-- День 3:
-- Овсянка + Творог + Куриная грудка + Рис с овощами + Паста + Фрукты =
-- =200 + 150 + 250 + 400 + 600 + 100
-- =1700кал.

ALTER SEQUENCE dish_dish_id_seq
    INCREMENT 50;

ALTER SEQUENCE user_storage_user_id_seq
    INCREMENT 50;

ALTER SEQUENCE meal_meal_id_seq
    INCREMENT 50;